export const CategoryMockData = [
    {id: '1111111', description: 'Литература'},
    {id: '2222222', description: 'Кино'},
    {id: '3333333', description: 'Театр'},
    {id: '4444444', description: 'Наука'},
    {id: '5555555', description: 'Искусство'},
    {id: '6666666', description: 'Музыка'}]

export const EventsMockData = {
    categories: {
        '1111111': [{
            id: '1',
            year: '1992',
            description: 'Нобелевскуя премия по литературе - Дерек Уолткотт, \' блестящий образец карибского эпоса  delete 64 разделах\'',
            categoryId: '1111111'
        }, {
            id: '2',
            year: '1994',
            description: '\'Бессонница\' - роман Стивена Кинга\'',
            categoryId: '1111111'
        }, {
            id: '3',
            year: '1995',
            description: 'Нобелевская премия по литературе - Шеймас Хини',
            categoryId: '1111111'
        }, {
            id: '4',
            year: '1997',
            description: '\'Гарри Поттер и Философвский камень\' - Джоан Роулинг',
            categoryId: '1111111'
        }],
        '2222222': [{
            id: '9',
            year: '1988',
            description: '\'Кто подставил кролика Роджера\'/Who Framed Roger Rabbit, США(реж.Роберт Земекис) ',
            categoryId: '2222222'
        },
            {
                id: '10',
                year: '1989',
                description: '\'Назад в Будущее 2/Back To The Future 2\', США(реж.Роберт Земекис) ',
                categoryId: '2222222'
            },
            {
                id: '11',
                year: '1990',
                description: '\'Крепкий орешек 2\'/Die hard  2, США(реж.Ренни Харлин) ',
                categoryId: '2222222'
            },
            {
                id: '12',
                year: '1991',
                description: '\'Семейка Аддамс\'/The Addams Family, США(реж.Барри Зонненфельд) ',
                categoryId: '2222222'
            },
            {
                id: '8',
                year: '1987',
                description: '"Хищник"/Предатор, США(реж.Джон Мактирнан)',
                categoryId: '2222222'
            },],
        '3333333': [
            {
                id: '5',
                year: '1999',
                description: 'Премьера балета \'Золушка\' в постановке Жан-Кристофа  Майо, сценографа Эрнеста Пиьона ',
                categoryId: '3333333'
            },
            {
                id: '6',
                year: '2000',
                description: 'Возобновлено издание журнала \'Театр\'.',
                categoryId: '3333333'
            },
            {
                id: '7',
                year: '2002',
                description: 'Премьера трилогии Тома Стоппарда \'Берег Утопии\', Королевский Национальный театр, Лондон',
                categoryId: '3333333'
            },],
        '5555555': [{
            'id': '1',
            'year': '1991',
            'description': 'Крупная ретроспектива работ Фриды Кало в Музее современного искусства в Нью-Йорке',
            'categoryId': '5555555'
        },
            {
                'id': '2',
                'year': '1992',
                'description': 'Открытие музея Гуггенхайма в Бильбао (Испания) по проекту Фрэнка Гери - архитектурная сенсация',
                'categoryId': '5555555'
            },
            {
                'id': '3',
                'year': '1993',
                'description': 'Венецианская биеннале посвящена теме "Основные направления" - ключевое событие в мире современного искусства',
                'categoryId': '5555555'
            },
            {
                'id': '4',
                'year': '1995',
                'description': 'Персональная выставка Йозефа Бойса в Центре Помпиду в Париже',
                'categoryId': '5555555'
            },
            {
                'id': '5',
                'year': '1997',
                'description': 'Выставка "Сокровища Тутанхамона" в музее Метрополитен - одна из самых посещаемых в истории',
                'categoryId': '5555555'
            },
            {
                'id': '6',
                'year': '1999',
                'description': 'Открытие Tate Modern в Лондоне в здании бывшей электростанции Bankside',
                'categoryId': '5555555'
            }],
        '4444444': [
            {
                id: '13',
                year: '2015',
                description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
                categoryId: '4444444'
            },
            {
                id: '14',
                year: '2016',
                description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
                categoryId: '4444444'
            },
            {
                id: '15',
                year: '2017',
                description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
                categoryId: '4444444'
            },
            {
                id: '16',
                year: '2018',
                description: 'Старт космического аппарата Solr Probe  Plus, предназначенного для изучения Солнца',
                categoryId: '4444444'
            },
            {
                id: '17',
                year: '2019',
                description: 'Google объявил о создании 53-кубитного квантового компьютера.',
                categoryId: '4444444'
            },
            {
                id: '18',
                year: '2020',
                description: 'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта',
                categoryId: '4444444'
            },],
        '6666666': [{
            id: '1',
            year: '1991',
            description: 'Выход альбома "Nevermind" группы Nirvana, который возглавил чарты и коммерциализировал гранж-движение',
            categoryId: '6666666'
        },
            {
                id: '2',
                year: '1992',
                description: 'Выпуск дебютного альбома "The Chronic" Dr. Dre, который задал новые стандарты в хип-хопе и джи-фанке',
                categoryId: '6666666'
            },
            {
                id: '3',
                year: '1994',
                description: 'Группа Pink Floyd выпускает последний студийный альбом "The Division Bell" и отправляется в масштабный тур',
                categoryId: '6666666'
            },
            {
                id: '4',
                year: '1996',
                description: 'Трибьют-альбом "Twisted Willie" в честь Вилли Нельсона с участием крупнейших рок-исполнителей',
                categoryId: '6666666'
            },
            {
                id: '5',
                year: '1998',
                description: 'Мадонна выпускает альбом "Ray of Light", отмеченный Grammy и знаменующий её творческое перерождение',
                categoryId: '6666666'
            },
            {
                id: '6',
                year: '1999',
                description: 'Основание сервиса Napster, который революционизировал распространение музыки в интернете',
                categoryId: '6666666'
            }]
    }
}

export type CategoryType = {
    id: string,
    description: string,
}


